In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [7]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns =['A','B','C','D'],
                   index = ['frog','chicken','goat','cat'])
animals

          A   B   C   D
frog      0   1   2   3
chicken   4   5   6   7
goat      8   9  10  11
cat      12  13  14  15

In [3]:
animals.loc[animals.index[1:2],['B','C']]= np.nan 
animals

          A     B     C   D
frog      0   1.0   2.0   3
chicken   4   NaN   NaN   7
goat      8   9.0  10.0  11
cat      12  13.0  14.0  15

In [22]:
b_map = {'A': 'good','B': 'bad','C':'good','D': 'bad'}

In [23]:
a_col = animals.groupby(b_map,axis = 1)

a_col.sum()

C:\Users\HP\AppData\Local\Temp\ipykernel_7652\1820069434.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  a_col = animals.groupby(b_map,axis = 1)

         bad  good
frog       4     2
chicken   12    10
goat      20    18
cat       28    26

In [19]:
animals

          A   B   C   D
frog      0   1   2   3
chicken   4   5   6   7
goat      8   9  10  11
cat      12  13  14  15

In [24]:
b_ser = Series(b_map)

b_ser

A    good
B     bad
C    good
D     bad
dtype: object

In [26]:
animals.groupby(b_ser,axis = 1).count()

C:\Users\HP\AppData\Local\Temp\ipykernel_7652\2088531076.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  animals.groupby(b_ser,axis = 1).count()

         bad  good
frog       2     2
chicken    2     2
goat       2     2
cat        2     2

In [27]:
animals.groupby(len).sum()

    A   B   C   D
3  12  13  14  15
4   8  10  12  14
7   4   5   6   7

In [28]:
k = ['A','B','A','B']

In [30]:
animals.groupby([k]).max()

    A   B   C   D
A   8   9  10  11
B  12  13  14  15

In [31]:
hr_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]], names =['city','city_val'])

hr_col

MultiIndex([('NY', 1),
            ('NY', 2),
            ('NY', 3),
            ('SF', 1),
            ('SF', 2)],
           names=['city', 'city_val'])

In [32]:
dframe = DataFrame(np.arange(25).reshape(5,5), columns = hr_col)

In [33]:
dframe

city      NY          SF
city_val   1   2   3   1   2
0          0   1   2   3   4
1          5   6   7   8   9
2         10  11  12  13  14
3         15  16  17  18  19
4         20  21  22  23  24

In [34]:
dframe *100

city        NY                SF
city_val     1     2     3     1     2
0            0   100   200   300   400
1          500   600   700   800   900
2         1000  1100  1200  1300  1400
3         1500  1600  1700  1800  1900
4         2000  2100  2200  2300  2400